// Logical operators
// ||, &&, !, !!, ??

// || - Логическое ИЛИ
// || - Возвращает первое положительное truthy значение или последнее значение
// || - Находит первое истинное значение или возвращает последний операнд

let a;

a = 1 || 2; // 1
a = 0 || 2; // 2

a = true || false; // true
a = false || true; // true
a = false || false; // false (получаем последний операнд)

a = false || false || true; // true
a = null || undefined || 1; // 1

// console.log(a);

const age = 25;

if (age > 20 || age < 25) { // если первый операн = true, то на второй операнд код не смотрит
    // console.log("Вы приняты");
}
// -------------------------------------------------

// && - Логическое И
// && - при проверках возвращает true, если оба аргумента истинны, а иначе – false
// или возвращает первое ложное значение как результат выражения

/* 
Вычисляет операнды слева направо.
Каждый операнд преобразует в логическое значение. Если результат false, 
останавливается и возвращает исходное значение этого операнда.
Если все операнды были истинными, возвращается последний.
Другими словами, && (И) возвращает первое ложное значение. Или последнее, если ничего не найдено.
Разница в том, что && (И) возвращает первое ложное значение, а ||(ИЛИ) –  первое истинное. 
*/

// let b;

// if (0 && 5) {
//     // if (false)
//     console.log("код внутри фигурных скобок не сработает");
// }

// b = 0 && 5; // 0 возвращаем перевое false значение
// b = true && "100"; // "100" если все true, то выводим последнее трушное значение

// if (true && "100") {
//     // if (true)
//     // console.log("код внутри фигурных скобок сработает");
// }

// console.log(b);

// const check = 10 && 0 && 20 && "Hello"; // 0
// console.log(check);

// const hour = 10;
// const minuters = 35;

// if(hour >= 10 && minuters >= 30) {
//     console.log("Заходите");
// }

// -------------------------------------------------

// ! - Логическое отрицание. По сути меняет значение на противоположное
/*
Оператор принимает один аргумент и выполняет следующие действия:
1) Сначала приводит аргумент к логическому типу true/false.
2) Затем возвращает противоположное значение.
*/

let c;

c = !true; // false
c = !false; // true
c = !0; // true
c = "Hello"; // "Hello"
c = !"Hello"; // false

// !! - для преобразования значений к логическому (boolean)

c = !!"Hello"; // true переводит в логический тип (булеан) и возвращает значение (без реверса)
c = !!""; // false
c = !!0; // false
c = !!1; // true
c = !!null; //false

// Boolean
c = Boolean(null); // false
c = Boolean(1); // true

// console.log(c);
// -------------------------------------------------

// ?? - Возвращает правый операнд если левый равен null или undefined, иначе возвращает левый операнд
// все возвращается кроме null и undefined (левый операнд)

let d;

d = 1 ?? 2; // 1
d = undefined ?? 2; // 2
d = null ?? 2; // 2
d = null ?? undefined; // undefined
d = undefined ?? null; // null
d = false ?? 2; // false
d = true ?? 2; // true
d = '' ?? 10; // ""
d = 0 ?? 10; // 0
d = null ?? false; // false


console.log(d);