// Массивы (arrays)
/* 
Если необходима упорядоченная коллекция данных, в которой присутствуют 1-й, 2-й, 3-й элементы 
и т.д. Например, для хранения списка пользователей, товаров, элементов и т.д.

В этом случае использовать объект неудобно, так как он не предоставляет методов управления по
рядком элементов. Нельзя вставить новое свойство «между» уже существующими. Объекты просто не 
предназначены для этих целей.

Для хранения упорядоченных коллекций существует особая структура данных, которая называется м
ассив.
*/

const log = console.log;

// const arr = [];
// const arr = new Array();

const numbers = [1, 10, 33, 45, 99, 130];
const arrayMix = [1, 2, "hello", true, undefined, null, {}, []];

// log(numbers); // [ 1, 10, 33, 45, 99, 130 ]
// log(numbers[3]); // 45

// log(arrayMix); // [ 1, 2, 'hello', true, undefined, null, {}, [] ]

// log(typeof numbers); // object

// ---------------------------------------

// let x = numbers[5] + numbers[1] // 130 + 10
// log(x); // 140

// ---------------------------------------

// numbers[5] = 1000;
// log(numbers); // [ 1, 10, 33, 45, 99, 1000 ]
// log(numbers.length); // 6

// ---------------------------------------

// const newArray = new Array(1, 2, 3, 5, "hello");
// log(newArray); // [ 1, 2, 3, 5, 'hello' ]

// ---------------------------------------
// Копирование массивов

// const copiedArray = numbers;
// log(copiedArray);  // [ 1, 10, 33, 45, 99, 130 ]
// log(copiedArray === numbers);  // true

// copiedArray[0] = 999;
// log(copiedArray === numbers);  // true
// log(copiedArray[0], numbers[0]);  // 999 999

// ---------------------------------------

// Методы добавления элементов в массив
numbers.unshift(111); // Добавляет елемент в начало массива
log(numbers); // [111,  1,  10, 33, 45, 99, 130]

numbers.push(777); // Добавляет елемент в конец массива
numbers.push(888);
log(numbers); // [111,  1,  10,  33, 45, 99, 130, 777, 888]


// Методы удаления элементов из массива
numbers.shift(); // Выдаляет первый элемент из массива и возвращает его
log(numbers); // [1,  10,  33, 45, 99, 130, 777, 888]

numbers.pop(); // Выдаляет последний элемент из массива и возвращает его
log(numbers); // [1,  10,  33, 45, 99, 130, 777, 888]


const lastValue = numbers.pop();
log(numbers); // [ 1, 10, 33, 45, 99, 130 ]
log(lastValue); // 777