// Math object

let x;

x = Math.min(4, 7, 2, 13);  // 2
x = Math.max(4, 7, 2, 13);  // 13


// Округления
x = Math.ceil(5.3); // 6 до большего целого
x = Math.floor(5.3); // 5 до меньшего целого
x = Math.round(5.3); // 5 округление по правилам математики

x = Math.trunc(5.3423423423) // 5 возвращает целое значение числа, без десятичной точки

// -------------------------------------------------
// Возведение в степень
x = Math.pow(3, 2); // 9 (возведение в степень) 
x = Math.pow(3, 3); // 27 (возведение в степень) 
x = Math.pow(3, 4); // 81 (возведение в степень) 

// Квадратный корень
x = Math.sqrt(81); // 9 получение евадратного еорня
x = Math.abs(-48); // 48 получение абсолютного значения числа

// ---------------------------------------------

// генерация случайных значений

// x = Math.random();
// x = Math.floor(Math.random() * 50 + 1);
// x = Math.floor(Math.random() * 100 + 1);
x = Math.floor(Math.random() * 50 + 1)

console.log(x);