// **3 задача:**

// Напишите `switch`, который принимает на вход возраст человека и выводит сообщение о жизненном этапе: 
// "Ребёнок" (0-12 лет), "Подросток" (13-17 лет), "Взрослый" (18-64 года), или "Пожилой человек" (65 лет и старше). 
// Если введено число меньше 0, программа должна вывести сообщение `Некорректный ввод`.

// ```JavaScript
//     const age = 13;
// ```


// Solution
const age = 13;

switch (true) {
    case age >= 0 && age <= 12:
        console.log("Ребёнок");
        break;
    case age >= 13 && age <= 17:
        console.log("Подросток");
        break;
    case age >= 18 && age <= 64:
        console.log("Взрослый");
        break;
    case age >= 65:
        console.log("Пожилой человек");
        break;
    default:
        console.log("Некорректный ввод");
}