// if statements - Условные ветвдения

// const age = 17;

// if (age >= 18) {
//     console.log('заходи!');
// } else {
//     console.log('еще рановато!');
// }

// if (age !== 18) {
//     console.log('еще !!!');
// }

// Инструкция if (…) вычисляет выражение в скобках и преобразует результат к логическому типу.
/* 
Число 0, пустая строка "", null, undefined и NaN становятся false. 
Из-за этого их называют «ложными» («falsy») значениями.
Остальные значения становятся true, поэтому их называют «правдивыми» («truthy»).
*/

// if (0) { } // false
// if (1) { } // true
// if ('0') { } // true
// if ('') { } // false
// if (' ') { } // true

// if (true) {
//     console.log('это правда. Эта ветка выполнится всегда');
// }

// if (false) {
//     console.log('это ложь. Эта ветка не выполнится никогда');
// }

// ------------------------------------------------

// const res = prompt("Как ваши дела?", "Хорошо");

// if (res === "Хорошо!") {
//     alert("Замечательно");
// } else if (res === "Нормально") {
//     alert("Стремитесь, чтобы было хорошо")
// } else if (res === "Плохо") {
//     alert("Нужно все делать по новой");
// } else {
//     alert("Пожайлуста, введите одно и предолженных ответов: Хорошо, Нормально или Плохо");
// }
// ------------------------------------------------

// Тернарный оператор (имеет три операнда)

const myAge = 20;

// if(myAge > 18) {
//     // ...
// } else {
//     // ...
// }

// ? = 1f
// : = else
// условие ? выражение1 : выражение2 

let result = myAge > 18 ? true : false;
console.log(result);