// Рекурсия (recursion)

const log = console.log;


// ---------------Возведение в натуральную степень-----------------------------------------

// Решение с помощью цикла
// const pow1 = (x, n) => {
//     let result = 1;

//     for (let i = 0; i < n; i++) {
//         result *= x;
//     }

//     return result;
// }

// log(pow1(2, 3));  // 8

// // Решение с помошью рекурсии
// const pow = (x, n) => {
//     if (n === 1) {
//         return x;
//     } else {
//         return x * pow(x, n - 1);  // 2 * (2 * pow(2, 1))
//     }
// }

// log(pow(2, 3));  // 8


// -----------------------Сумма чисел---------------------------

// Решение с помощью цикла
// const sum1 = (n) => {
//     let sum = 0;
//     for (let i = 1; i <= 5; i++) {
//         sum += i;
//     }

//     return sum;
// }

// log(sum1(5));  // 1 + 2 + 3 + 4 + 5 (15)

// // Решение с помошью рекурсии
// const sum = (n) => {
//     if (n === 1) return 1;

//     return n + sum(n - 1);
// }

// log(sum(5));  // 1 + 2 + 3 + 4 + 5 (15)

// // Математическое решение (самое оптимальное с тчоки зрения производительности)
// const sum3 = (n) => {
//     return n * (n + 1) / 2;
// }

// log(sum3(5));  // 15


// -----------------------Факториал числа---------------------------

/* 
Факториал — это произведение всех натуральных чисел от 1
до данного числа. Например, факториал числа 5 будет равен
1 × 2 × 3 × 4 × 5 = 120 
*/

const factorial = (n) => {
    return (n != 1) ? n * factorial(n - 1) : 1;
}
log(factorial(5)) // 120